import requests, json

url = "http://172.25.20.245:4151/pub?topic=algorithm_multi_level"
# data = {"reason_id": 101, "content_id": 1600096737}


data = {
    "project_id": 924,
    "content_id": 100000002,
    "title": "域名人名搜索测试",
    "sort": 20200305,
    "desc": "域名人名搜索测试描述",
    "cover": [
        "http://qukan-test.oss-cn-beijing.aliyuncs.com/svsnapshot/qtt_short_video_snapshot_self/306eb92f9b15583eab1eb47fe24789d8/00002.jpg"],
    "author_id": 1231,
    "publish_at": "2020-01-01 12:12:!2",
    "author_name": "哈哈哈",
    "detail": [{
        "list": [{
            "url": "http://qukan-test.oss-cn-beijing.aliyuncs.com/svsnapshot/qtt_short_video_snapshot_self/306eb92f9b15583eab1eb47fe24789d8/00002.jpg",
            "desc": "http://wx1.sinaimg.cn/mw600/0076BSS5ly1gnbb3vhqwkj30jg0t6aqt.jpg"
        }, {
            "url": "http://qukan-test.oss-cn-beijing.aliyuncs.com/svsnapshot/qtt_short_video_snapshot_self/306eb92f9b15583eab1eb47fe24789d8/00002.jpg",
            "desc": "http://wx4.sinaimg.cn/mw600/0076BSS5ly1gnb9j5nx7pj30p00zk7c3.jpg"
        }],
        "type": "image"
    }, {
        "list": [{
            "html_code": "<p>dfnsdfnisdnfisdnfisdnfinsdifndisfnidsnfisdnfjofnvjifdbvijdnvojdfnvodvnodfvnokdfvn<\/p><p>十三年前，超逸国旅从一家“夫妻店”起步，虽也曾走过弯路，但发挥区位和自身资源优势，抓住移动互联网机遇，发展 国内旅游和电子票务代订业务，终成年营收破亿，年接待30万人次的山东半岛地区大社。</p>"
        }],
        "type": "html"
    }, {
        "list": [{
            "video_address": "http://short-video-test-output.oss-cn-beijing.aliyuncs.com/qtt_short_video_self/66d439877d4f502eb6ac0b6f288bf42d/hd.mp4",
            "desc": "百度小视频"
        }, {
            "video_address": "http://v4.qutoutiao.net/toutiao_video_zdgq_online_self/34f602954a825b97af9a35d9234ca666/ld.mp4",
            "desc": "画心师"
        }],
        "type": "video"
    }, {
        "list": [{
            "text": "这是 一大段长长的内容实体<div>{% for str in params.list_test %}{% if str == '金毛'%}{% endfor %}</div>"
        }],
        "type": "text"
    }],
    "question": [{
        "title": "单选",
        "type": "radio",
        "key": "up_features",
        "question": ["其他", "实用性", "稀缺性、领域热点", "....."],
        "default": ["其他"]
    }, {
        "title": "多选",
        "type": "select",
        "allow_add": "true",
        "key": "down_features",
        "question": ["标题党（有模型）", "其他低质"]
    }, {
        "title": "文本",
        "type": "text",
        "key": "down_features",
        "question": [],
        "default": ["实用性"]
    }, {
        "title": "api1",
        "type": "api_substance_select",
        "allow_add": "true",
        "key": "l2_concept_video",
        "question": ["api_substance_select", "现代舞蹈", "明星综艺", "综艺", "创意舞蹈", "帅哥舞蹈", "素人综艺", "明星娱乐", "舞蹈家", "舞蹈综艺", "独舞",
                     "综艺节目", "搞笑舞蹈", "手指舞"],
        "default": []
    }, {
        "title": "api1",
        "type": "api_per_select",
        "allow_add": "true",
        "key": "l2_concept_video",
        "question": ["api_per_select", "现代舞蹈", "明星综艺", "综艺", "创意舞蹈", "帅哥舞蹈", "素人综艺", "明星娱乐", "舞蹈家", "舞蹈综艺", "独舞",
                     "综艺节目", "搞笑舞蹈", "手指舞"],
        "default": []
    }, {
        "title": "api1",
        "type": "api_film_select",
        "allow_add": "true",
        "key": "l2_concept_video",
        "question": ["api_film_select", "现代舞蹈", "明星综艺", "综艺", "创意舞蹈", "帅哥舞蹈", "素人综艺", "明星娱乐", "舞蹈家", "舞蹈综艺", "独舞",
                     "综艺节目", "搞笑舞蹈", "手指舞"],
        "default": []
    }, {
        "title": "api1",
        "type": "api_concept_select",
        "allow_add": "true",
        "key": "l2_concept_video",
        "question": ["api_concept_select", "现代舞蹈", "明星综艺", "综艺", "创意舞蹈", "帅哥舞蹈", "素人综艺", "明星娱乐", "舞蹈家", "舞蹈综艺", "独舞",
                     "综艺节目", "搞笑舞蹈", "手指舞"],
        "default": []
    }, {
        "type": "tree_radio",
        "key": "l2_cate_video",
        "title": "一二级分类纠正",
        "allow_add": "false",
        "question": [{
            "军事": ["环球军情", "中国军情", "武器装备", "军事历史", "军事其他", "军人风采"]
        }, {
            "社会": ["社会法治", "意外事故", "社会百态", "民生新闻", "社会其他"]
        }, {
            "时政": ["时政外交", "港澳台动态", "高层动态", "中层和基层动态", "时政其他"]
        }, {
            "国际": ["国际政治", "国际经济", "国际关系", "国际社会", "国际其他"]
        }, {
            "娱乐": ["明星", "综艺", "影视", "娱乐其他"]
        }, {
            "财经": ["金融", "财富人物", "宏观经济", "公司新闻", "财经其他"]
        }, {
            "房产": ["房产"]
        }, {
            "科技": ["互联网", "人工智能", "软件", "通讯", "航空航天", "机械", "科技其他"]
        }, {
            "数码": ["电脑", "手机", "数码家电", "数码其他"]
        }, {
            "历史": ["中国古代史", "中国近现代史", "世界史", "野史秘闻", "考古史", "历史其他"]
        }, {
            "汽车": ["新车", "行业资讯", "导购", "用车", "花边", "汽车其他"]
        }, {
            "三农": ["乡村生活", "农业信息", "农业技术", "赶海打野", "三农其他"]
        }, {
            "收藏": ["收藏"]
        }, {
            "文化": ["国学", "文学", "民俗", "艺术", "戏曲", "魔术", "杂技", "文化其他"]
        }, {
            "故事": ["故事"]
        }, {
            "游戏": ["手游", "单机游戏", "电竞游戏", "网游", "棋牌游戏", "游戏其他"]
        }, {
            "搞笑": ["相声小品", "脱口秀", "情景剧", "搞笑其他"]
        }, {
            "动漫": ["日韩", "欧美", "国创", "动漫其他"]
        }, {
            "运势": ["星座", "占卜", "生肖", "命理", "风水", "运势其他"]
        }, {
            "体育": ["足球", "篮球", "排球", "乒乓球", "羽毛球", "网球", "棋牌", "台球", "赛车", "高尔夫", "搏击", "冰雪运动", "极限运动", "游泳", "马拉松",
                   "健身", "田径", "武术", "跳水", "体操", "体育其他"]
        }, {
            "奇闻": ["奇闻"]
        }, {
            "家居": ["家居"]
        }, {
            "旅游": ["国内游", "境外游", "旅游其他"]
        }, {
            "美食": ["美食教程", "探店", "美食文化", "吃播", "美食其他"]
        }, {
            "宠物": ["猫", "狗", "宠物其他"]
        }, {
            "情感": ["婚姻", "恋爱", "家庭", "情感心理", "情感自制剧", "情感其他"]
        }, {
            "生活": ["生活百科", "钓鱼", "园艺", "手工制作", "生活其他"]
        }, {
            "时尚": ["时尚资讯", "时装搭配", "美容美体", "奢侈品", "时尚街拍", "时尚走秀", "时尚其他"]
        }, {
            "健康": ["疾病防治与用药", "两性健康", "生活健康", "中医", "癌症", "瘦身", "整形", "养生", "医界资讯", "健康其他"]
        }, {
            "育儿": ["孕育知识", "萌娃", "玩具", "宝宝看动画", "绘画手工", "育儿其他"]
        }, {
            "教育": ["小初高教育", "高等教育", "资格考试", "考研", "留学", "外语学习", "技能学习", "演讲公开课", "教育其他"]
        }, {
            "音乐": ["音乐解说", "主播", "纯音乐", "音乐秀", "音乐其他"]
        }, {
            "舞蹈": ["古典舞", "现代舞", "街舞", "广场舞", "舞蹈其他"]
        }, {
            "职场": ["职场"]
        }, {
            "宗教": ["佛学", "道学", "宗教其他"]
        }, {
            "科学": ["科普", "科学探索", "动植物与微生物", "科学其他"]
        }, {
            "摄影": ["摄影知识", "摄影器材", "摄影作品", "婚纱摄影", "摄影其他"]
        }],
        "default": ["舞蹈", {
            "舞蹈": "街舞"
        }]
    }]
}

data_qukan = {
    "project_id": 925,
    "content_id": 1600074671,
    "question": [{
        "title": "单选",
        "type": "radio",
        "key": "up_features",
        "question": ["其他", "实用性", "稀缺性、领域热点", "....."]
    }, {
        "title": "多选",
        "type": "select",
        "allow_add": "true",
        "key": "down_features",
        "question": ["标题党（有模型）", "其他低质"]
    }, {
        "title": "文本",
        "type": "text",
        "key": "down_features",
        "question": []
    }, {
        "title": "api1",
        "type": "api_substance_select",
        "allow_add": "true",
        "key": "l2_concept_video",
        "question": ["api_substance_select", "现代舞蹈", "明星综艺", "综艺", "创意舞蹈", "帅哥舞蹈", "素人综艺", "明星娱乐", "舞蹈家", "舞蹈综艺", "独舞",
                     "综艺节目", "搞笑舞蹈", "手指舞"],
        "default": []
    }, {
        "title": "api1",
        "type": "api_per_select",
        "allow_add": "true",
        "key": "l2_concept_video",
        "question": ["api_per_select", "现代舞蹈", "明星综艺", "综艺", "创意舞蹈", "帅哥舞蹈", "素人综艺", "明星娱乐", "舞蹈家", "舞蹈综艺", "独舞",
                     "综艺节目", "搞笑舞蹈", "手指舞"],
        "default": []
    }, {
        "title": "api1",
        "type": "api_film_select",
        "allow_add": "true",
        "key": "l2_concept_video",
        "question": ["api_film_select", "现代舞蹈", "明星综艺", "综艺", "创意舞蹈", "帅哥舞蹈", "素人综艺", "明星娱乐", "舞蹈家", "舞蹈综艺", "独舞",
                     "综艺节目", "搞笑舞蹈", "手指舞"],
        "default": []
    }, {
        "title": "api1",
        "type": "api_concept_select",
        "allow_add": "true",
        "key": "l2_concept_video",
        "question": ["api_concept_select", "现代舞蹈", "明星综艺", "综艺", "创意舞蹈", "帅哥舞蹈", "素人综艺", "明星娱乐", "舞蹈家", "舞蹈综艺", "独舞",
                     "综艺节目", "搞笑舞蹈", "手指舞"],
        "default": []
    }, {
        "type": "tree_radio",
        "key": "l2_cate_video",
        "title": "一二级分类纠正",
        "allow_add": "false",
        "question": [{
            "军事": ["环球军情", "中国军情", "武器装备", "军事历史", "军事其他", "军人风采"]
        }, {
            "社会": ["社会法治", "意外事故", "社会百态", "民生新闻", "社会其他"]
        }, {
            "时政": ["时政外交", "港澳台动态", "高层动态", "中层和基层动态", "时政其他"]
        }, {
            "国际": ["国际政治", "国际经济", "国际关系", "国际社会", "国际其他"]
        }, {
            "娱乐": ["明星", "综艺", "影视", "娱乐其他"]
        }, {
            "财经": ["金融", "财富人物", "宏观经济", "公司新闻", "财经其他"]
        }, {
            "房产": ["房产"]
        }, {
            "科技": ["互联网", "人工智能", "软件", "通讯", "航空航天", "机械", "科技其他"]
        }, {
            "数码": ["电脑", "手机", "数码家电", "数码其他"]
        }, {
            "历史": ["中国古代史", "中国近现代史", "世界史", "野史秘闻", "考古史", "历史其他"]
        }, {
            "汽车": ["新车", "行业资讯", "导购", "用车", "花边", "汽车其他"]
        }, {
            "三农": ["乡村生活", "农业信息", "农业技术", "赶海打野", "三农其他"]
        }, {
            "收藏": ["收藏"]
        }, {
            "文化": ["国学", "文学", "民俗", "艺术", "戏曲", "魔术", "杂技", "文化其他"]
        }, {
            "故事": ["故事"]
        }, {
            "游戏": ["手游", "单机游戏", "电竞游戏", "网游", "棋牌游戏", "游戏其他"]
        }, {
            "搞笑": ["相声小品", "脱口秀", "情景剧", "搞笑其他"]
        }, {
            "动漫": ["日韩", "欧美", "国创", "动漫其他"]
        }, {
            "运势": ["星座", "占卜", "生肖", "命理", "风水", "运势其他"]
        }, {
            "体育": ["足球", "篮球", "排球", "乒乓球", "羽毛球", "网球", "棋牌", "台球", "赛车", "高尔夫", "搏击", "冰雪运动", "极限运动", "游泳", "马拉松",
                   "健身", "田径", "武术", "跳水", "体操", "体育其他"]
        }, {
            "奇闻": ["奇闻"]
        }, {
            "家居": ["家居"]
        }, {
            "旅游": ["国内游", "境外游", "旅游其他"]
        }, {
            "美食": ["美食教程", "探店", "美食文化", "吃播", "美食其他"]
        }, {
            "宠物": ["猫", "狗", "宠物其他"]
        }, {
            "情感": ["婚姻", "恋爱", "家庭", "情感心理", "情感自制剧", "情感其他"]
        }, {
            "生活": ["生活百科", "钓鱼", "园艺", "手工制作", "生活其他"]
        }, {
            "时尚": ["时尚资讯", "时装搭配", "美容美体", "奢侈品", "时尚街拍", "时尚走秀", "时尚其他"]
        }, {
            "健康": ["疾病防治与用药", "两性健康", "生活健康", "中医", "癌症", "瘦身", "整形", "养生", "医界资讯", "健康其他"]
        }, {
            "育儿": ["孕育知识", "萌娃", "玩具", "宝宝看动画", "绘画手工", "育儿其他"]
        }, {
            "教育": ["小初高教育", "高等教育", "资格考试", "考研", "留学", "外语学习", "技能学习", "演讲公开课", "教育其他"]
        }, {
            "音乐": ["音乐解说", "主播", "纯音乐", "音乐秀", "音乐其他"]
        }, {
            "舞蹈": ["古典舞", "现代舞", "街舞", "广场舞", "舞蹈其他"]
        }, {
            "职场": ["职场"]
        }, {
            "宗教": ["佛学", "道学", "宗教其他"]
        }, {
            "科学": ["科普", "科学探索", "动植物与微生物", "科学其他"]
        }, {
            "摄影": ["摄影知识", "摄影器材", "摄影作品", "婚纱摄影", "摄影其他"]
        }]
    }]
}

data_qukan01 = {
    "project_id": 925,
    "content_id": 1600074671,
    "question": [{
        "title": "api1",
        "type": "api_per_select",
        "allow_add": "true",
        "key": "l2_concept_video",
        "question": [],
        "default": []
    }, {
        "title": "api1",
        "type": "api_film_select",
        "allow_add": "true",
        "key": "l2_concept_video",
        "question": [],
        "default": []
    }]
}
headers = {
    "key": "Content-Type",
    "value": "application/x-www-form-urlencoded",
    "description": "",
    "enabled": "true"
}

aa = requests.post(url=url, data=json.dumps(data_qukan01), headers=headers)
print(aa.text)
